---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndtreatmentEndType
source: html/cb6dea04-55f0-5ed5-cf33-540bbef116d1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndtreatmentEndType Property

"End Treatment At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeEndtreatmentEndType { get; }
```